# 객체를 왜 사용하는지?
# 객체 : 필드 + 메서드
#
# 클래스 구현
# 인스턴스 생성
# 인스턴스 활용
#
# 생성자
# 디폴트 매개변수 생성자
# self
#
# 클래스 변수 , 인스턴스 변수
# 클래스이름.필드 => 클래스 변수 이용
#
# 필드 , 메서드 사용
# 비공개 필드 : __필드
# 비공개 메서드 : __메서드()
#
# __매직메서드__ : + , - , < , >
# __init(self)__
# __eq__() , __repr__() , __str__() , __del__() , __ne__() , __add__() , ....
#
# 상속
# class superClass:
#     pass
#
# class subClass(superClass):
#     pass
#
# super().__init__()
#
# 메서드 재정의
#
# 포함관계(has-a)
# 동등관계(is-a)
#
# =========================
# 클래스 메소드 , 정적 메소드
# 다중상속
#
